import { _ } from "assets://js/lib/cat.js";
let key = '高中课堂';
let homeName = '高中高效学习方法';
let HOST = 'https://api.bilibili.com';
let siteKey = '';
let siteType = 0;
let searchable= 0;//searchable=1 启用搜索
const PC_UA = "Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/115.0.0.0 Safari/537.361";
let cookie = "https://mirror.ghproxy.com/https://raw.githubusercontent.com/HiTang123/xyz/master/main/cookie.txt";
async function request(reqUrl) {
  const res = await req(reqUrl, {
      headers: getMb(),
  });
  return res.content;
}

async function init(cfg) {
  siteKey = cfg.skey;
  siteType = cfg.stype;
  if (cookie.startsWith('http')) cookie = await request(cookie);
  // console.debug('我的哔哩 cookie =====>' + cookie); // js_debug.log
}

async function home(filter) {
  let classes = [{
		"type_name": "高一语文",
		"type_id": "高一语文"
	}, {
		"type_name": "高一数学",
		"type_id": "高一数学"
	}, {
		"type_name": "高一英语",
		"type_id": "高一英语"
	}, {
		"type_name": "高一历史",
		"type_id": "高一历史"
	}, {
		"type_name": "高一地理",
		"type_id": "高一地理"
	}, {
		"type_name": "高一生物",
		"type_id": "高一生物"
	}, {
		"type_name": "高一思想政治",
		"type_id": "高一思想政治"
	}, {
		"type_name": "高一物理",
		"type_id": "高一物理"
	}, {
		"type_name": "高一化学",
		"type_id": "高一化学"
	}, {
		"type_name": "高二语文",
		"type_id": "高二语文"
	}, {
		"type_name": "高二数学",
		"type_id": "高二数学"
	}, {
		"type_name": "高二英语",
		"type_id": "高二英语"
	}, {
		"type_name": "高二历史",
		"type_id": "高二历史"
	}, {
		"type_name": "高二地理",
		"type_id": "高二地理"
	}, {
		"type_name": "高二生物",
		"type_id": "高二生物"
	}, {
		"type_name": "高二思想政治",
		"type_id": "高二思想政治"
	}, {
		"type_name": "高二物理",
		"type_id": "高二物理"
	}, {
		"type_name": "高二化学",
		"type_id": "高二化学"
	}, {
		"type_name": "高三语文",
		"type_id": "高三语文"
	}, {
		"type_name": "高三数学",
		"type_id": "高三数学"
	}, {
		"type_name": "高三英语",
		"type_id": "高三英语"
	}, {
		"type_name": "高三历史",
		"type_id": "高三历史"
	}, {
		"type_name": "高三地理",
		"type_id": "高三地理"
	}, {
		"type_name": "高三生物",
		"type_id": "高三生物"
	}, {
		"type_name": "高三思想政治",
		"type_id": "高三思想政治"
	}, {
		"type_name": "高三物理",
		"type_id": "高三物理"
	}, {
		"type_name": "高三化学",
		"type_id": "高三化学"
	}, {
		"type_name": "高中信息技术",
		"type_id": "高中信息技术"
	}, {
		"type_name": "高中信息技术",
		"type_id": "高中信息技术"
	}];
  let filterObj = {
		"1年级语文": [{
			"key": "tid",
			"name": "分类",
			"value": [{
				"n": "全部",
				"v": "0"
			}, {
				"n": "沪教版",
				"v": "沪教版1年级语文"
			}, {
				"n": "人教版",
				"v": "人教版1年级语文"
			}, {
				"n": "北师大版",
				"v": "北师大版1年级语文"
			}, {
				"n": "苏教版",
				"v": "苏教版1年级语文"
			}]
		}, {
			"key": "duration",
			"name": "时长",
			"value": [{
				"n": "全部",
				"v": "0"
			}, {
				"n": "60分钟以上",
				"v": "4"
			}, {
				"n": "30~60分钟",
				"v": "3"
			}, {
				"n": "10~30分钟",
				"v": "2"
			}, {
				"n": "10分钟以下",
				"v": "1"
			}]
		}],
		"1年级英语": [{
			"key": "tid",
			"name": "分类",
			"value": [{
				"n": "全部",
				"v": "0"
			}, {
				"n": "沪教版",
				"v": "沪教版1年级英语"
			}, {
				"n": "人教版",
				"v": "人教版1年级英语"
			}, {
				"n": "北师大版",
				"v": "北师大版1年级英语"
			}, {
				"n": "苏教版",
				"v": "苏教版1年级英语"
			}]
		}, {
			"key": "duration",
			"name": "时长",
			"value": [{
				"n": "全部",
				"v": "0"
			}, {
				"n": "60分钟以上",
				"v": "4"
			}, {
				"n": "30~60分钟",
				"v": "3"
			}, {
				"n": "10~30分钟",
				"v": "2"
			}, {
				"n": "10分钟以下",
				"v": "1"
			}]
		}],
		"1年级数学": [{
			"key": "tid",
			"name": "分类",
			"value": [{
				"n": "全部",
				"v": "0"
			}, {
				"n": "沪教版",
				"v": "沪教版1年级数学"
			}, {
				"n": "人教版",
				"v": "人教版1年级数学"
			}, {
				"n": "北师大版",
				"v": "北师大版1年级数学"
			}, {
				"n": "苏教版",
				"v": "苏教版1年级数学"
			}]
		}, {
			"key": "duration",
			"name": "时长",
			"value": [{
				"n": "全部",
				"v": "0"
			}, {
				"n": "60分钟以上",
				"v": "4"
			}, {
				"n": "30~60分钟",
				"v": "3"
			}, {
				"n": "10~30分钟",
				"v": "2"
			}, {
				"n": "10分钟以下",
				"v": "1"
			}]
		}],
		"2年级语文": [{
			"key": "tid",
			"name": "分类",
			"value": [{
				"n": "全部",
				"v": "0"
			}, {
				"n": "沪教版",
				"v": "沪教版2年级语文"
			}, {
				"n": "人教版",
				"v": "人教版2年级语文"
			}, {
				"n": "北师大版",
				"v": "北师大版2年级语文"
			}, {
				"n": "苏教版",
				"v": "苏教版2年级语文"
			}]
		}, {
			"key": "duration",
			"name": "时长",
			"value": [{
				"n": "全部",
				"v": "0"
			}, {
				"n": "60分钟以上",
				"v": "4"
			}, {
				"n": "30~60分钟",
				"v": "3"
			}, {
				"n": "10~30分钟",
				"v": "2"
			}, {
				"n": "10分钟以下",
				"v": "1"
			}]
		}],
		"2年级英语": [{
			"key": "tid",
			"name": "分类",
			"value": [{
				"n": "全部",
				"v": "0"
			}, {
				"n": "沪教版",
				"v": "沪教版2年级英语"
			}, {
				"n": "人教版",
				"v": "人教版2年级英语"
			}, {
				"n": "北师大版",
				"v": "北师大版2年级英语"
			}, {
				"n": "苏教版",
				"v": "苏教版2年级英语"
			}]
		}, {
			"key": "duration",
			"name": "时长",
			"value": [{
				"n": "全部",
				"v": "0"
			}, {
				"n": "60分钟以上",
				"v": "4"
			}, {
				"n": "30~60分钟",
				"v": "3"
			}, {
				"n": "10~30分钟",
				"v": "2"
			}, {
				"n": "10分钟以下",
				"v": "1"
			}]
		}],
		"2年级数学": [{
			"key": "tid",
			"name": "分类",
			"value": [{
				"n": "全部",
				"v": "0"
			}, {
				"n": "沪教版",
				"v": "沪教版2年级数学"
			}, {
				"n": "人教版",
				"v": "人教版2年级数学"
			}, {
				"n": "北师大版",
				"v": "北师大版2年级数学"
			}, {
				"n": "苏教版",
				"v": "苏教版2年级数学"
			}]
		}, {
			"key": "duration",
			"name": "时长",
			"value": [{
				"n": "全部",
				"v": "0"
			}, {
				"n": "60分钟以上",
				"v": "4"
			}, {
				"n": "30~60分钟",
				"v": "3"
			}, {
				"n": "10~30分钟",
				"v": "2"
			}, {
				"n": "10分钟以下",
				"v": "1"
			}]
		}],
		"3年级语文": [{
			"key": "tid",
			"name": "分类",
			"value": [{
				"n": "全部",
				"v": "0"
			}, {
				"n": "沪教版",
				"v": "沪教版3年级语文"
			}, {
				"n": "人教版",
				"v": "人教版3年级语文"
			}, {
				"n": "北师大版",
				"v": "北师大版3年级语文"
			}, {
				"n": "苏教版",
				"v": "苏教版3年级语文"
			}]
		}, {
			"key": "duration",
			"name": "时长",
			"value": [{
				"n": "全部",
				"v": "0"
			}, {
				"n": "60分钟以上",
				"v": "4"
			}, {
				"n": "30~60分钟",
				"v": "3"
			}, {
				"n": "10~30分钟",
				"v": "2"
			}, {
				"n": "10分钟以下",
				"v": "1"
			}]
		}],
		"3年级英语": [{
			"key": "tid",
			"name": "分类",
			"value": [{
				"n": "全部",
				"v": "0"
			}, {
				"n": "沪教版",
				"v": "沪教版3年级英语"
			}, {
				"n": "人教版",
				"v": "人教版3年级英语"
			}, {
				"n": "北师大版",
				"v": "北师大版3年级英语"
			}, {
				"n": "苏教版",
				"v": "苏教版3年级英语"
			}]
		}, {
			"key": "duration",
			"name": "时长",
			"value": [{
				"n": "全部",
				"v": "0"
			}, {
				"n": "60分钟以上",
				"v": "4"
			}, {
				"n": "30~60分钟",
				"v": "3"
			}, {
				"n": "10~30分钟",
				"v": "2"
			}, {
				"n": "10分钟以下",
				"v": "1"
			}]
		}],
		"3年级数学": [{
			"key": "tid",
			"name": "分类",
			"value": [{
				"n": "全部",
				"v": "0"
			}, {
				"n": "沪教版",
				"v": "沪教版3年级数学"
			}, {
				"n": "人教版",
				"v": "人教版3年级数学"
			}, {
				"n": "北师大版",
				"v": "北师大版3年级数学"
			}, {
				"n": "苏教版",
				"v": "苏教版3年级数学"
			}]
		}, {
			"key": "duration",
			"name": "时长",
			"value": [{
				"n": "全部",
				"v": "0"
			}, {
				"n": "60分钟以上",
				"v": "4"
			}, {
				"n": "30~60分钟",
				"v": "3"
			}, {
				"n": "10~30分钟",
				"v": "2"
			}, {
				"n": "10分钟以下",
				"v": "1"
			}]
		}],
		"4年级语文": [{
			"key": "tid",
			"name": "分类",
			"value": [{
				"n": "全部",
				"v": "0"
			}, {
				"n": "沪教版",
				"v": "沪教版4年级语文"
			}, {
				"n": "人教版",
				"v": "人教版4年级语文"
			}, {
				"n": "北师大版",
				"v": "北师大版4年级语文"
			}, {
				"n": "苏教版",
				"v": "苏教版4年级语文"
			}]
		}, {
			"key": "duration",
			"name": "时长",
			"value": [{
				"n": "全部",
				"v": "0"
			}, {
				"n": "60分钟以上",
				"v": "4"
			}, {
				"n": "30~60分钟",
				"v": "3"
			}, {
				"n": "10~30分钟",
				"v": "2"
			}, {
				"n": "10分钟以下",
				"v": "1"
			}]
		}],
		"4年级英语": [{
			"key": "tid",
			"name": "分类",
			"value": [{
				"n": "全部",
				"v": "0"
			}, {
				"n": "沪教版",
				"v": "沪教版4年级英语"
			}, {
				"n": "人教版",
				"v": "人教版4年级英语"
			}, {
				"n": "北师大版",
				"v": "北师大版4年级英语"
			}, {
				"n": "苏教版",
				"v": "苏教版4年级英语"
			}]
		}, {
			"key": "duration",
			"name": "时长",
			"value": [{
				"n": "全部",
				"v": "0"
			}, {
				"n": "60分钟以上",
				"v": "4"
			}, {
				"n": "30~60分钟",
				"v": "3"
			}, {
				"n": "10~30分钟",
				"v": "2"
			}, {
				"n": "10分钟以下",
				"v": "1"
			}]
		}],
		"4年级数学": [{
			"key": "tid",
			"name": "分类",
			"value": [{
				"n": "全部",
				"v": "0"
			}, {
				"n": "沪教版",
				"v": "沪教版4年级数学"
			}, {
				"n": "人教版",
				"v": "人教版4年级数学"
			}, {
				"n": "北师大版",
				"v": "北师大版4年级数学"
			}, {
				"n": "苏教版",
				"v": "苏教版4年级数学"
			}]
		}, {
			"key": "duration",
			"name": "时长",
			"value": [{
				"n": "全部",
				"v": "0"
			}, {
				"n": "60分钟以上",
				"v": "4"
			}, {
				"n": "30~60分钟",
				"v": "3"
			}, {
				"n": "10~30分钟",
				"v": "2"
			}, {
				"n": "10分钟以下",
				"v": "1"
			}]
		}],
		"5年级语文": [{
			"key": "tid",
			"name": "分类",
			"value": [{
				"n": "全部",
				"v": "0"
			}, {
				"n": "沪教版",
				"v": "沪教版5年级语文"
			}, {
				"n": "人教版",
				"v": "人教版5年级语文"
			}, {
				"n": "北师大版",
				"v": "北师大版5年级语文"
			}, {
				"n": "苏教版",
				"v": "苏教版5年级语文"
			}]
		}, {
			"key": "duration",
			"name": "时长",
			"value": [{
				"n": "全部",
				"v": "0"
			}, {
				"n": "60分钟以上",
				"v": "4"
			}, {
				"n": "30~60分钟",
				"v": "3"
			}, {
				"n": "10~30分钟",
				"v": "2"
			}, {
				"n": "10分钟以下",
				"v": "1"
			}]
		}],
		"5年级英语": [{
			"key": "tid",
			"name": "分类",
			"value": [{
				"n": "全部",
				"v": "0"
			}, {
				"n": "沪教版",
				"v": "沪教版5年级英语"
			}, {
				"n": "人教版",
				"v": "人教版5年级英语"
			}, {
				"n": "北师大版",
				"v": "北师大版5年级英语"
			}, {
				"n": "苏教版",
				"v": "苏教版5年级英语"
			}]
		}, {
			"key": "duration",
			"name": "时长",
			"value": [{
				"n": "全部",
				"v": "0"
			}, {
				"n": "60分钟以上",
				"v": "4"
			}, {
				"n": "30~60分钟",
				"v": "3"
			}, {
				"n": "10~30分钟",
				"v": "2"
			}, {
				"n": "10分钟以下",
				"v": "1"
			}]
		}],
		"5年级数学": [{
			"key": "tid",
			"name": "分类",
			"value": [{
				"n": "全部",
				"v": "0"
			}, {
				"n": "沪教版",
				"v": "沪教版5年级数学"
			}, {
				"n": "人教版",
				"v": "人教版5年级数学"
			}, {
				"n": "北师大版",
				"v": "北师大版5年级数学"
			}, {
				"n": "苏教版",
				"v": "苏教版5年级数学"
			}]
		}, {
			"key": "duration",
			"name": "时长",
			"value": [{
				"n": "全部",
				"v": "0"
			}, {
				"n": "60分钟以上",
				"v": "4"
			}, {
				"n": "30~60分钟",
				"v": "3"
			}, {
				"n": "10~30分钟",
				"v": "2"
			}, {
				"n": "10分钟以下",
				"v": "1"
			}]
		}],
		"6年级语文": [{
			"key": "tid",
			"name": "分类",
			"value": [{
				"n": "全部",
				"v": "0"
			}, {
				"n": "沪教版",
				"v": "沪教版6年级语文"
			}, {
				"n": "人教版",
				"v": "人教版6年级语文"
			}, {
				"n": "北师大版",
				"v": "北师大版6年级语文"
			}, {
				"n": "苏教版",
				"v": "苏教版6年级语文"
			}]
		}, {
			"key": "duration",
			"name": "时长",
			"value": [{
				"n": "全部",
				"v": "0"
			}, {
				"n": "60分钟以上",
				"v": "4"
			}, {
				"n": "30~60分钟",
				"v": "3"
			}, {
				"n": "10~30分钟",
				"v": "2"
			}, {
				"n": "10分钟以下",
				"v": "1"
			}]
		}],
		"6年级英语": [{
			"key": "tid",
			"name": "分类",
			"value": [{
				"n": "全部",
				"v": "0"
			}, {
				"n": "沪教版",
				"v": "沪教版6年级英语"
			}, {
				"n": "人教版",
				"v": "人教版6年级英语"
			}, {
				"n": "北师大版",
				"v": "北师大版6年级英语"
			}, {
				"n": "苏教版",
				"v": "苏教版6年级英语"
			}]
		}, {
			"key": "duration",
			"name": "时长",
			"value": [{
				"n": "全部",
				"v": "0"
			}, {
				"n": "60分钟以上",
				"v": "4"
			}, {
				"n": "30~60分钟",
				"v": "3"
			}, {
				"n": "10~30分钟",
				"v": "2"
			}, {
				"n": "10分钟以下",
				"v": "1"
			}]
		}],
		"6年级数学": [{
			"key": "tid",
			"name": "分类",
			"value": [{
				"n": "全部",
				"v": "0"
			}, {
				"n": "沪教版",
				"v": "沪教版6年级数学"
			}, {
				"n": "人教版",
				"v": "人教版6年级数学"
			}, {
				"n": "北师大版",
				"v": "北师大版6年级数学"
			}, {
				"n": "苏教版",
				"v": "苏教版6年级数学"
			}]
		}, {
			"key": "duration",
			"name": "时长",
			"value": [{
				"n": "全部",
				"v": "0"
			}, {
				"n": "60分钟以上",
				"v": "4"
			}, {
				"n": "30~60分钟",
				"v": "3"
			}, {
				"n": "10~30分钟",
				"v": "2"
			}, {
				"n": "10分钟以下",
				"v": "1"
			}]
		}],
		"7年级语文": [{
			"key": "tid",
			"name": "分类",
			"value": [{
				"n": "全部",
				"v": "0"
			}, {
				"n": "沪教版",
				"v": "沪教版7年级语文"
			}, {
				"n": "人教版",
				"v": "人教版7年级语文"
			}, {
				"n": "北师大版",
				"v": "北师大版7年级语文"
			}, {
				"n": "苏教版",
				"v": "苏教版7年级语文"
			}]
		}, {
			"key": "duration",
			"name": "时长",
			"value": [{
				"n": "全部",
				"v": "0"
			}, {
				"n": "60分钟以上",
				"v": "4"
			}, {
				"n": "30~60分钟",
				"v": "3"
			}, {
				"n": "10~30分钟",
				"v": "2"
			}, {
				"n": "10分钟以下",
				"v": "1"
			}]
		}],
		"7年级英语": [{
			"key": "tid",
			"name": "分类",
			"value": [{
				"n": "全部",
				"v": "0"
			}, {
				"n": "沪教版",
				"v": "沪教版7年级英语"
			}, {
				"n": "人教版",
				"v": "人教版7年级英语"
			}, {
				"n": "北师大版",
				"v": "北师大版7年级英语"
			}, {
				"n": "苏教版",
				"v": "苏教版7年级英语"
			}]
		}, {
			"key": "duration",
			"name": "时长",
			"value": [{
				"n": "全部",
				"v": "0"
			}, {
				"n": "60分钟以上",
				"v": "4"
			}, {
				"n": "30~60分钟",
				"v": "3"
			}, {
				"n": "10~30分钟",
				"v": "2"
			}, {
				"n": "10分钟以下",
				"v": "1"
			}]
		}],
		"7年级数学": [{
			"key": "tid",
			"name": "分类",
			"value": [{
				"n": "全部",
				"v": "0"
			}, {
				"n": "沪教版",
				"v": "沪教版7年级数学"
			}, {
				"n": "人教版",
				"v": "人教版7年级数学"
			}, {
				"n": "北师大版",
				"v": "北师大版7年级数学"
			}, {
				"n": "苏教版",
				"v": "苏教版7年级数学"
			}]
		}, {
			"key": "duration",
			"name": "时长",
			"value": [{
				"n": "全部",
				"v": "0"
			}, {
				"n": "60分钟以上",
				"v": "4"
			}, {
				"n": "30~60分钟",
				"v": "3"
			}, {
				"n": "10~30分钟",
				"v": "2"
			}, {
				"n": "10分钟以下",
				"v": "1"
			}]
		}],
		"7年级化学": [{
			"key": "tid",
			"name": "分类",
			"value": [{
				"n": "全部",
				"v": "0"
			}, {
				"n": "沪教版",
				"v": "沪教版7年级化学"
			}, {
				"n": "人教版",
				"v": "人教版7年级化学"
			}, {
				"n": "北师大版",
				"v": "北师大版7年级化学"
			}, {
				"n": "苏教版",
				"v": "苏教版7年级化学"
			}]
		}, {
			"key": "duration",
			"name": "时长",
			"value": [{
				"n": "全部",
				"v": "0"
			}, {
				"n": "60分钟以上",
				"v": "4"
			}, {
				"n": "30~60分钟",
				"v": "3"
			}, {
				"n": "10~30分钟",
				"v": "2"
			}, {
				"n": "10分钟以下",
				"v": "1"
			}]
		}],
		"7年级物理": [{
			"key": "tid",
			"name": "分类",
			"value": [{
				"n": "全部",
				"v": "0"
			}, {
				"n": "沪教版",
				"v": "沪教版7年级物理"
			}, {
				"n": "人教版",
				"v": "人教版7年级物理"
			}, {
				"n": "北师大版",
				"v": "北师大版7年级物理"
			}, {
				"n": "苏教版",
				"v": "苏教版7年级物理"
			}]
		}, {
			"key": "duration",
			"name": "时长",
			"value": [{
				"n": "全部",
				"v": "0"
			}, {
				"n": "60分钟以上",
				"v": "4"
			}, {
				"n": "30~60分钟",
				"v": "3"
			}, {
				"n": "10~30分钟",
				"v": "2"
			}, {
				"n": "10分钟以下",
				"v": "1"
			}]
		}],
		"7年级生物": [{
			"key": "tid",
			"name": "分类",
			"value": [{
				"n": "全部",
				"v": "0"
			}, {
				"n": "沪教版",
				"v": "沪教版7年级生物"
			}, {
				"n": "人教版",
				"v": "人教版7年级生物"
			}, {
				"n": "北师大版",
				"v": "北师大版7年级生物"
			}, {
				"n": "苏教版",
				"v": "苏教版7年级生物"
			}]
		}, {
			"key": "duration",
			"name": "时长",
			"value": [{
				"n": "全部",
				"v": "0"
			}, {
				"n": "60分钟以上",
				"v": "4"
			}, {
				"n": "30~60分钟",
				"v": "3"
			}, {
				"n": "10~30分钟",
				"v": "2"
			}, {
				"n": "10分钟以下",
				"v": "1"
			}]
		}],
		"7年级历史": [{
			"key": "tid",
			"name": "分类",
			"value": [{
				"n": "全部",
				"v": "0"
			}, {
				"n": "沪教版",
				"v": "沪教版7年级历史"
			}, {
				"n": "人教版",
				"v": "人教版7年级历史"
			}, {
				"n": "北师大版",
				"v": "北师大版7年级历史"
			}, {
				"n": "苏教版",
				"v": "苏教版7年级历史"
			}]
		}, {
			"key": "duration",
			"name": "时长",
			"value": [{
				"n": "全部",
				"v": "0"
			}, {
				"n": "60分钟以上",
				"v": "4"
			}, {
				"n": "30~60分钟",
				"v": "3"
			}, {
				"n": "10~30分钟",
				"v": "2"
			}, {
				"n": "10分钟以下",
				"v": "1"
			}]
		}],
		"8年级语文": [{
			"key": "tid",
			"name": "分类",
			"value": [{
				"n": "全部",
				"v": "0"
			}, {
				"n": "沪教版",
				"v": "沪教版8年级语文"
			}, {
				"n": "人教版",
				"v": "人教版8年级语文"
			}, {
				"n": "北师大版",
				"v": "北师大版8年级语文"
			}, {
				"n": "苏教版",
				"v": "苏教版8年级语文"
			}]
		}, {
			"key": "duration",
			"name": "时长",
			"value": [{
				"n": "全部",
				"v": "0"
			}, {
				"n": "60分钟以上",
				"v": "4"
			}, {
				"n": "30~60分钟",
				"v": "3"
			}, {
				"n": "10~30分钟",
				"v": "2"
			}, {
				"n": "10分钟以下",
				"v": "1"
			}]
		}],
		"8年级英语": [{
			"key": "tid",
			"name": "分类",
			"value": [{
				"n": "全部",
				"v": "0"
			}, {
				"n": "沪教版",
				"v": "沪教版8年级英语"
			}, {
				"n": "人教版",
				"v": "人教版8年级英语"
			}, {
				"n": "北师大版",
				"v": "北师大版8年级英语"
			}, {
				"n": "苏教版",
				"v": "苏教版8年级英语"
			}]
		}, {
			"key": "duration",
			"name": "时长",
			"value": [{
				"n": "全部",
				"v": "0"
			}, {
				"n": "60分钟以上",
				"v": "4"
			}, {
				"n": "30~60分钟",
				"v": "3"
			}, {
				"n": "10~30分钟",
				"v": "2"
			}, {
				"n": "10分钟以下",
				"v": "1"
			}]
		}],
		"8年级数学": [{
			"key": "tid",
			"name": "分类",
			"value": [{
				"n": "全部",
				"v": "0"
			}, {
				"n": "沪教版",
				"v": "沪教版8年级数学"
			}, {
				"n": "人教版",
				"v": "人教版8年级数学"
			}, {
				"n": "北师大版",
				"v": "北师大版8年级数学"
			}, {
				"n": "苏教版",
				"v": "苏教版8年级数学"
			}]
		}, {
			"key": "duration",
			"name": "时长",
			"value": [{
				"n": "全部",
				"v": "0"
			}, {
				"n": "60分钟以上",
				"v": "4"
			}, {
				"n": "30~60分钟",
				"v": "3"
			}, {
				"n": "10~30分钟",
				"v": "2"
			}, {
				"n": "10分钟以下",
				"v": "1"
			}]
		}],
		"8年级化学": [{
			"key": "tid",
			"name": "分类",
			"value": [{
				"n": "全部",
				"v": "0"
			}, {
				"n": "沪教版",
				"v": "沪教版8年级化学"
			}, {
				"n": "人教版",
				"v": "人教版8年级化学"
			}, {
				"n": "北师大版",
				"v": "北师大版8年级化学"
			}, {
				"n": "苏教版",
				"v": "苏教版8年级化学"
			}]
		}, {
			"key": "duration",
			"name": "时长",
			"value": [{
				"n": "全部",
				"v": "0"
			}, {
				"n": "60分钟以上",
				"v": "4"
			}, {
				"n": "30~60分钟",
				"v": "3"
			}, {
				"n": "10~30分钟",
				"v": "2"
			}, {
				"n": "10分钟以下",
				"v": "1"
			}]
		}],
		"8年级物理": [{
			"key": "tid",
			"name": "分类",
			"value": [{
				"n": "全部",
				"v": "0"
			}, {
				"n": "沪教版",
				"v": "沪教版8年级物理"
			}, {
				"n": "人教版",
				"v": "人教版8年级物理"
			}, {
				"n": "北师大版",
				"v": "北师大版8年级物理"
			}, {
				"n": "苏教版",
				"v": "苏教版8年级物理"
			}]
		}, {
			"key": "duration",
			"name": "时长",
			"value": [{
				"n": "全部",
				"v": "0"
			}, {
				"n": "60分钟以上",
				"v": "4"
			}, {
				"n": "30~60分钟",
				"v": "3"
			}, {
				"n": "10~30分钟",
				"v": "2"
			}, {
				"n": "10分钟以下",
				"v": "1"
			}]
		}],
		"8年级生物": [{
			"key": "tid",
			"name": "分类",
			"value": [{
				"n": "全部",
				"v": "0"
			}, {
				"n": "沪教版",
				"v": "沪教版8年级生物"
			}, {
				"n": "人教版",
				"v": "人教版8年级生物"
			}, {
				"n": "北师大版",
				"v": "北师大版8年级生物"
			}, {
				"n": "苏教版",
				"v": "苏教版8年级生物"
			}]
		}, {
			"key": "duration",
			"name": "时长",
			"value": [{
				"n": "全部",
				"v": "0"
			}, {
				"n": "60分钟以上",
				"v": "4"
			}, {
				"n": "30~60分钟",
				"v": "3"
			}, {
				"n": "10~30分钟",
				"v": "2"
			}, {
				"n": "10分钟以下",
				"v": "1"
			}]
		}],
		"8年级历史": [{
			"key": "tid",
			"name": "分类",
			"value": [{
				"n": "全部",
				"v": "0"
			}, {
				"n": "沪教版",
				"v": "沪教版8年级历史"
			}, {
				"n": "人教版",
				"v": "人教版8年级历史"
			}, {
				"n": "北师大版",
				"v": "北师大版8年级历史"
			}, {
				"n": "苏教版",
				"v": "苏教版8年级历史"
			}]
		}, {
			"key": "duration",
			"name": "时长",
			"value": [{
				"n": "全部",
				"v": "0"
			}, {
				"n": "60分钟以上",
				"v": "4"
			}, {
				"n": "30~60分钟",
				"v": "3"
			}, {
				"n": "10~30分钟",
				"v": "2"
			}, {
				"n": "10分钟以下",
				"v": "1"
			}]
		}],
		"9年级语文": [{
			"key": "tid",
			"name": "分类",
			"value": [{
				"n": "全部",
				"v": "0"
			}, {
				"n": "沪教版",
				"v": "沪教版9年级语文"
			}, {
				"n": "人教版",
				"v": "人教版9年级语文"
			}, {
				"n": "北师大版",
				"v": "北师大版9年级语文"
			}, {
				"n": "苏教版",
				"v": "苏教版9年级语文"
			}]
		}, {
			"key": "duration",
			"name": "时长",
			"value": [{
				"n": "全部",
				"v": "0"
			}, {
				"n": "60分钟以上",
				"v": "4"
			}, {
				"n": "30~60分钟",
				"v": "3"
			}, {
				"n": "10~30分钟",
				"v": "2"
			}, {
				"n": "10分钟以下",
				"v": "1"
			}]
		}],
		"9年级英语": [{
			"key": "tid",
			"name": "分类",
			"value": [{
				"n": "全部",
				"v": "0"
			}, {
				"n": "沪教版",
				"v": "沪教版9年级英语"
			}, {
				"n": "人教版",
				"v": "人教版9年级英语"
			}, {
				"n": "北师大版",
				"v": "北师大版9年级英语"
			}, {
				"n": "苏教版",
				"v": "苏教版9年级英语"
			}]
		}, {
			"key": "duration",
			"name": "时长",
			"value": [{
				"n": "全部",
				"v": "0"
			}, {
				"n": "60分钟以上",
				"v": "4"
			}, {
				"n": "30~60分钟",
				"v": "3"
			}, {
				"n": "10~30分钟",
				"v": "2"
			}, {
				"n": "10分钟以下",
				"v": "1"
			}]
		}],
		"9年级数学": [{
			"key": "tid",
			"name": "分类",
			"value": [{
				"n": "全部",
				"v": "0"
			}, {
				"n": "沪教版",
				"v": "沪教版9年级数学"
			}, {
				"n": "人教版",
				"v": "人教版9年级数学"
			}, {
				"n": "北师大版",
				"v": "北师大版9年级数学"
			}, {
				"n": "苏教版",
				"v": "苏教版9年级数学"
			}]
		}, {
			"key": "duration",
			"name": "时长",
			"value": [{
				"n": "全部",
				"v": "0"
			}, {
				"n": "60分钟以上",
				"v": "4"
			}, {
				"n": "30~60分钟",
				"v": "3"
			}, {
				"n": "10~30分钟",
				"v": "2"
			}, {
				"n": "10分钟以下",
				"v": "1"
			}]
		}],
		"9年级化学": [{
			"key": "tid",
			"name": "分类",
			"value": [{
				"n": "全部",
				"v": "0"
			}, {
				"n": "沪教版",
				"v": "沪教版9年级化学"
			}, {
				"n": "人教版",
				"v": "人教版9年级化学"
			}, {
				"n": "北师大版",
				"v": "北师大版9年级化学"
			}, {
				"n": "苏教版",
				"v": "苏教版9年级化学"
			}]
		}, {
			"key": "duration",
			"name": "时长",
			"value": [{
				"n": "全部",
				"v": "0"
			}, {
				"n": "60分钟以上",
				"v": "4"
			}, {
				"n": "30~60分钟",
				"v": "3"
			}, {
				"n": "10~30分钟",
				"v": "2"
			}, {
				"n": "10分钟以下",
				"v": "1"
			}]
		}],
		"9年级物理": [{
			"key": "tid",
			"name": "分类",
			"value": [{
				"n": "全部",
				"v": "0"
			}, {
				"n": "沪教版",
				"v": "沪教版9年级物理"
			}, {
				"n": "人教版",
				"v": "人教版9年级物理"
			}, {
				"n": "北师大版",
				"v": "北师大版9年级物理"
			}, {
				"n": "苏教版",
				"v": "苏教版9年级物理"
			}]
		}, {
			"key": "duration",
			"name": "时长",
			"value": [{
				"n": "全部",
				"v": "0"
			}, {
				"n": "60分钟以上",
				"v": "4"
			}, {
				"n": "30~60分钟",
				"v": "3"
			}, {
				"n": "10~30分钟",
				"v": "2"
			}, {
				"n": "10分钟以下",
				"v": "1"
			}]
		}],
		"9年级生物": [{
			"key": "tid",
			"name": "分类",
			"value": [{
				"n": "全部",
				"v": "0"
			}, {
				"n": "沪教版",
				"v": "沪教版9年级生物"
			}, {
				"n": "人教版",
				"v": "人教版9年级生物"
			}, {
				"n": "北师大版",
				"v": "北师大版9年级生物"
			}, {
				"n": "苏教版",
				"v": "苏教版9年级生物"
			}]
		}, {
			"key": "duration",
			"name": "时长",
			"value": [{
				"n": "全部",
				"v": "0"
			}, {
				"n": "60分钟以上",
				"v": "4"
			}, {
				"n": "30~60分钟",
				"v": "3"
			}, {
				"n": "10~30分钟",
				"v": "2"
			}, {
				"n": "10分钟以下",
				"v": "1"
			}]
		}],
		"9年级历史": [{
			"key": "tid",
			"name": "分类",
			"value": [{
				"n": "全部",
				"v": "0"
			}, {
				"n": "沪教版",
				"v": "沪教版9年级历史"
			}, {
				"n": "人教版",
				"v": "人教版9年级历史"
			}, {
				"n": "北师大版",
				"v": "北师大版9年级历史"
			}, {
				"n": "苏教版",
				"v": "苏教版9年级历史"
			}]
		}, {
			"key": "duration",
			"name": "时长",
			"value": [{
				"n": "全部",
				"v": "0"
			}, {
				"n": "60分钟以上",
				"v": "4"
			}, {
				"n": "30~60分钟",
				"v": "3"
			}, {
				"n": "10~30分钟",
				"v": "2"
			}, {
				"n": "10分钟以下",
				"v": "1"
			}]
		}],
		"高一语文": [{
			"key": "tid",
			"name": "分类",
			"value": [{
				"n": "全部",
				"v": "0"
			}, {
				"n": "沪教版",
				"v": "沪教版高一语文"
			}, {
				"n": "人教版",
				"v": "人教版高一语文"
			}, {
				"n": "北师大版",
				"v": "北师大版高一语文"
			}, {
				"n": "苏教版",
				"v": "苏教版高一语文"
			}]
		}, {
			"key": "duration",
			"name": "时长",
			"value": [{
				"n": "全部",
				"v": "0"
			}, {
				"n": "60分钟以上",
				"v": "4"
			}, {
				"n": "30~60分钟",
				"v": "3"
			}, {
				"n": "10~30分钟",
				"v": "2"
			}, {
				"n": "10分钟以下",
				"v": "1"
			}]
		}],
		"高一英语": [{
			"key": "tid",
			"name": "分类",
			"value": [{
				"n": "全部",
				"v": "0"
			}, {
				"n": "沪教版",
				"v": "沪教版高一英语"
			}, {
				"n": "人教版",
				"v": "人教版高一英语"
			}, {
				"n": "北师大版",
				"v": "北师大版高一英语"
			}, {
				"n": "苏教版",
				"v": "苏教版高一英语"
			}]
		}, {
			"key": "duration",
			"name": "时长",
			"value": [{
				"n": "全部",
				"v": "0"
			}, {
				"n": "60分钟以上",
				"v": "4"
			}, {
				"n": "30~60分钟",
				"v": "3"
			}, {
				"n": "10~30分钟",
				"v": "2"
			}, {
				"n": "10分钟以下",
				"v": "1"
			}]
		}],
		"高一数学": [{
			"key": "tid",
			"name": "分类",
			"value": [{
				"n": "全部",
				"v": "0"
			}, {
				"n": "沪教版",
				"v": "沪教版高一数学"
			}, {
				"n": "人教版",
				"v": "人教版高一数学"
			}, {
				"n": "北师大版",
				"v": "北师大版高一数学"
			}, {
				"n": "苏教版",
				"v": "苏教版高一数学"
			}]
		}, {
			"key": "duration",
			"name": "时长",
			"value": [{
				"n": "全部",
				"v": "0"
			}, {
				"n": "60分钟以上",
				"v": "4"
			}, {
				"n": "30~60分钟",
				"v": "3"
			}, {
				"n": "10~30分钟",
				"v": "2"
			}, {
				"n": "10分钟以下",
				"v": "1"
			}]
		}],
		"高一物理": [{
			"key": "tid",
			"name": "分类",
			"value": [{
				"n": "全部",
				"v": "0"
			}, {
				"n": "沪教版",
				"v": "沪教版高一物理"
			}, {
				"n": "人教版",
				"v": "人教版高一物理"
			}, {
				"n": "北师大版",
				"v": "北师大版高一物理"
			}, {
				"n": "苏教版",
				"v": "苏教版高一物理"
			}]
		}, {
			"key": "duration",
			"name": "时长",
			"value": [{
				"n": "全部",
				"v": "0"
			}, {
				"n": "60分钟以上",
				"v": "4"
			}, {
				"n": "30~60分钟",
				"v": "3"
			}, {
				"n": "10~30分钟",
				"v": "2"
			}, {
				"n": "10分钟以下",
				"v": "1"
			}]
		}],
		"高一化学": [{
			"key": "tid",
			"name": "分类",
			"value": [{
				"n": "全部",
				"v": "0"
			}, {
				"n": "沪教版",
				"v": "沪教版高一化学"
			}, {
				"n": "人教版",
				"v": "人教版高一化学"
			}, {
				"n": "北师大版",
				"v": "北师大版高一化学"
			}, {
				"n": "苏教版",
				"v": "苏教版高一化学"
			}]
		}, {
			"key": "duration",
			"name": "时长",
			"value": [{
				"n": "全部",
				"v": "0"
			}, {
				"n": "60分钟以上",
				"v": "4"
			}, {
				"n": "30~60分钟",
				"v": "3"
			}, {
				"n": "10~30分钟",
				"v": "2"
			}, {
				"n": "10分钟以下",
				"v": "1"
			}]
		}],
		"高一历史": [{
			"key": "tid",
			"name": "分类",
			"value": [{
				"n": "全部",
				"v": "0"
			}, {
				"n": "沪教版",
				"v": "沪教版高一历史"
			}, {
				"n": "人教版",
				"v": "人教版高一历史"
			}, {
				"n": "北师大版",
				"v": "北师大版高一历史"
			}, {
				"n": "苏教版",
				"v": "苏教版高一历史"
			}]
		}, {
			"key": "duration",
			"name": "时长",
			"value": [{
				"n": "全部",
				"v": "0"
			}, {
				"n": "60分钟以上",
				"v": "4"
			}, {
				"n": "30~60分钟",
				"v": "3"
			}, {
				"n": "10~30分钟",
				"v": "2"
			}, {
				"n": "10分钟以下",
				"v": "1"
			}]
		}],
		"高一生物": [{
			"key": "tid",
			"name": "分类",
			"value": [{
				"n": "全部",
				"v": "0"
			}, {
				"n": "沪教版",
				"v": "沪教版高一生物"
			}, {
				"n": "人教版",
				"v": "人教版高一生物"
			}, {
				"n": "北师大版",
				"v": "北师大版高一生物"
			}, {
				"n": "苏教版",
				"v": "苏教版高一生物"
			}]
		}, {
			"key": "duration",
			"name": "时长",
			"value": [{
				"n": "全部",
				"v": "0"
			}, {
				"n": "60分钟以上",
				"v": "4"
			}, {
				"n": "30~60分钟",
				"v": "3"
			}, {
				"n": "10~30分钟",
				"v": "2"
			}, {
				"n": "10分钟以下",
				"v": "1"
			}]
		}],
		"高一思想政治": [{
			"key": "tid",
			"name": "分类",
			"value": [{
				"n": "全部",
				"v": "0"
			}, {
				"n": "沪教版",
				"v": "沪教版高一思想政治"
			}, {
				"n": "人教版",
				"v": "人教版高一思想政治"
			}, {
				"n": "北师大版",
				"v": "北师大版高一思想政治"
			}, {
				"n": "苏教版",
				"v": "苏教版高一思想政治"
			}]
		}, {
			"key": "duration",
			"name": "时长",
			"value": [{
				"n": "全部",
				"v": "0"
			}, {
				"n": "60分钟以上",
				"v": "4"
			}, {
				"n": "30~60分钟",
				"v": "3"
			}, {
				"n": "10~30分钟",
				"v": "2"
			}, {
				"n": "10分钟以下",
				"v": "1"
			}]
		}],
		"高一地理": [{
			"key": "tid",
			"name": "分类",
			"value": [{
				"n": "全部",
				"v": "0"
			}, {
				"n": "沪教版",
				"v": "沪教版高一地理"
			}, {
				"n": "人教版",
				"v": "人教版高一地理"
			}, {
				"n": "北师大版",
				"v": "北师大版高一地理"
			}, {
				"n": "苏教版",
				"v": "苏教版高一地理"
			}]
		}, {
			"key": "duration",
			"name": "时长",
			"value": [{
				"n": "全部",
				"v": "0"
			}, {
				"n": "60分钟以上",
				"v": "4"
			}, {
				"n": "30~60分钟",
				"v": "3"
			}, {
				"n": "10~30分钟",
				"v": "2"
			}, {
				"n": "10分钟以下",
				"v": "1"
			}]
		}],
		"高二语文": [{
			"key": "tid",
			"name": "分类",
			"value": [{
				"n": "全部",
				"v": "0"
			}, {
				"n": "沪教版",
				"v": "沪教版高二语文"
			}, {
				"n": "人教版",
				"v": "人教版高二语文"
			}, {
				"n": "北师大版",
				"v": "北师大版高二语文"
			}, {
				"n": "苏教版",
				"v": "苏教版高二语文"
			}]
		}, {
			"key": "duration",
			"name": "时长",
			"value": [{
				"n": "全部",
				"v": "0"
			}, {
				"n": "60分钟以上",
				"v": "4"
			}, {
				"n": "30~60分钟",
				"v": "3"
			}, {
				"n": "10~30分钟",
				"v": "2"
			}, {
				"n": "10分钟以下",
				"v": "1"
			}]
		}],
		"高二英语": [{
			"key": "tid",
			"name": "分类",
			"value": [{
				"n": "全部",
				"v": "0"
			}, {
				"n": "沪教版",
				"v": "沪教版高二英语"
			}, {
				"n": "人教版",
				"v": "人教版高二英语"
			}, {
				"n": "北师大版",
				"v": "北师大版高二英语"
			}, {
				"n": "苏教版",
				"v": "苏教版高二英语"
			}]
		}, {
			"key": "duration",
			"name": "时长",
			"value": [{
				"n": "全部",
				"v": "0"
			}, {
				"n": "60分钟以上",
				"v": "4"
			}, {
				"n": "30~60分钟",
				"v": "3"
			}, {
				"n": "10~30分钟",
				"v": "2"
			}, {
				"n": "10分钟以下",
				"v": "1"
			}]
		}],
		"高二数学": [{
			"key": "tid",
			"name": "分类",
			"value": [{
				"n": "全部",
				"v": "0"
			}, {
				"n": "沪教版",
				"v": "沪教版高二数学"
			}, {
				"n": "人教版",
				"v": "人教版高二数学"
			}, {
				"n": "北师大版",
				"v": "北师大版高二数学"
			}, {
				"n": "苏教版",
				"v": "苏教版高二数学"
			}]
		}, {
			"key": "duration",
			"name": "时长",
			"value": [{
				"n": "全部",
				"v": "0"
			}, {
				"n": "60分钟以上",
				"v": "4"
			}, {
				"n": "30~60分钟",
				"v": "3"
			}, {
				"n": "10~30分钟",
				"v": "2"
			}, {
				"n": "10分钟以下",
				"v": "1"
			}]
		}],
		"高二物理": [{
			"key": "tid",
			"name": "分类",
			"value": [{
				"n": "全部",
				"v": "0"
			}, {
				"n": "沪教版",
				"v": "沪教版高二物理"
			}, {
				"n": "人教版",
				"v": "人教版高二物理"
			}, {
				"n": "北师大版",
				"v": "北师大版高二物理"
			}, {
				"n": "苏教版",
				"v": "苏教版高二物理"
			}]
		}, {
			"key": "duration",
			"name": "时长",
			"value": [{
				"n": "全部",
				"v": "0"
			}, {
				"n": "60分钟以上",
				"v": "4"
			}, {
				"n": "30~60分钟",
				"v": "3"
			}, {
				"n": "10~30分钟",
				"v": "2"
			}, {
				"n": "10分钟以下",
				"v": "1"
			}]
		}],
		"高二化学": [{
			"key": "tid",
			"name": "分类",
			"value": [{
				"n": "全部",
				"v": "0"
			}, {
				"n": "沪教版",
				"v": "沪教版高二化学"
			}, {
				"n": "人教版",
				"v": "人教版高二化学"
			}, {
				"n": "北师大版",
				"v": "北师大版高二化学"
			}, {
				"n": "苏教版",
				"v": "苏教版高二化学"
			}]
		}, {
			"key": "duration",
			"name": "时长",
			"value": [{
				"n": "全部",
				"v": "0"
			}, {
				"n": "60分钟以上",
				"v": "4"
			}, {
				"n": "30~60分钟",
				"v": "3"
			}, {
				"n": "10~30分钟",
				"v": "2"
			}, {
				"n": "10分钟以下",
				"v": "1"
			}]
		}],
		"高二历史": [{
			"key": "tid",
			"name": "分类",
			"value": [{
				"n": "全部",
				"v": "0"
			}, {
				"n": "沪教版",
				"v": "沪教版高二历史"
			}, {
				"n": "人教版",
				"v": "人教版高二历史"
			}, {
				"n": "北师大版",
				"v": "北师大版高二历史"
			}, {
				"n": "苏教版",
				"v": "苏教版高二历史"
			}]
		}, {
			"key": "duration",
			"name": "时长",
			"value": [{
				"n": "全部",
				"v": "0"
			}, {
				"n": "60分钟以上",
				"v": "4"
			}, {
				"n": "30~60分钟",
				"v": "3"
			}, {
				"n": "10~30分钟",
				"v": "2"
			}, {
				"n": "10分钟以下",
				"v": "1"
			}]
		}],
		"高二生物": [{
			"key": "tid",
			"name": "分类",
			"value": [{
				"n": "全部",
				"v": "0"
			}, {
				"n": "沪教版",
				"v": "沪教版高二生物"
			}, {
				"n": "人教版",
				"v": "人教版高二生物"
			}, {
				"n": "北师大版",
				"v": "北师大版高二生物"
			}, {
				"n": "苏教版",
				"v": "苏教版高二生物"
			}]
		}, {
			"key": "duration",
			"name": "时长",
			"value": [{
				"n": "全部",
				"v": "0"
			}, {
				"n": "60分钟以上",
				"v": "4"
			}, {
				"n": "30~60分钟",
				"v": "3"
			}, {
				"n": "10~30分钟",
				"v": "2"
			}, {
				"n": "10分钟以下",
				"v": "1"
			}]
		}],
		"高二思想政治": [{
			"key": "tid",
			"name": "分类",
			"value": [{
				"n": "全部",
				"v": "0"
			}, {
				"n": "沪教版",
				"v": "沪教版高二思想政治"
			}, {
				"n": "人教版",
				"v": "人教版高二思想政治"
			}, {
				"n": "北师大版",
				"v": "北师大版高二思想政治"
			}, {
				"n": "苏教版",
				"v": "苏教版高二思想政治"
			}]
		}, {
			"key": "duration",
			"name": "时长",
			"value": [{
				"n": "全部",
				"v": "0"
			}, {
				"n": "60分钟以上",
				"v": "4"
			}, {
				"n": "30~60分钟",
				"v": "3"
			}, {
				"n": "10~30分钟",
				"v": "2"
			}, {
				"n": "10分钟以下",
				"v": "1"
			}]
		}],
		"高二地理": [{
			"key": "tid",
			"name": "分类",
			"value": [{
				"n": "全部",
				"v": "0"
			}, {
				"n": "沪教版",
				"v": "沪教版高二地理"
			}, {
				"n": "人教版",
				"v": "人教版高二地理"
			}, {
				"n": "北师大版",
				"v": "北师大版高二地理"
			}, {
				"n": "苏教版",
				"v": "苏教版高二地理"
			}]
		}, {
			"key": "duration",
			"name": "时长",
			"value": [{
				"n": "全部",
				"v": "0"
			}, {
				"n": "60分钟以上",
				"v": "4"
			}, {
				"n": "30~60分钟",
				"v": "3"
			}, {
				"n": "10~30分钟",
				"v": "2"
			}, {
				"n": "10分钟以下",
				"v": "1"
			}]
		}],
		"高三语文": [{
			"key": "tid",
			"name": "分类",
			"value": [{
				"n": "全部",
				"v": "0"
			}, {
				"n": "沪教版",
				"v": "沪教版高三语文"
			}, {
				"n": "人教版",
				"v": "人教版高三语文"
			}, {
				"n": "北师大版",
				"v": "北师大版高三语文"
			}, {
				"n": "苏教版",
				"v": "苏教版高三语文"
			}]
		}, {
			"key": "duration",
			"name": "时长",
			"value": [{
				"n": "全部",
				"v": "0"
			}, {
				"n": "60分钟以上",
				"v": "4"
			}, {
				"n": "30~60分钟",
				"v": "3"
			}, {
				"n": "10~30分钟",
				"v": "2"
			}, {
				"n": "10分钟以下",
				"v": "1"
			}]
		}],
		"高三英语": [{
			"key": "tid",
			"name": "分类",
			"value": [{
				"n": "全部",
				"v": "0"
			}, {
				"n": "沪教版",
				"v": "沪教版高三英语"
			}, {
				"n": "人教版",
				"v": "人教版高三英语"
			}, {
				"n": "北师大版",
				"v": "北师大版高三英语"
			}, {
				"n": "苏教版",
				"v": "苏教版高三英语"
			}]
		}, {
			"key": "duration",
			"name": "时长",
			"value": [{
				"n": "全部",
				"v": "0"
			}, {
				"n": "60分钟以上",
				"v": "4"
			}, {
				"n": "30~60分钟",
				"v": "3"
			}, {
				"n": "10~30分钟",
				"v": "2"
			}, {
				"n": "10分钟以下",
				"v": "1"
			}]
		}],
		"高三数学": [{
			"key": "tid",
			"name": "分类",
			"value": [{
				"n": "全部",
				"v": "0"
			}, {
				"n": "沪教版",
				"v": "沪教版高三数学"
			}, {
				"n": "人教版",
				"v": "人教版高三数学"
			}, {
				"n": "北师大版",
				"v": "北师大版高三数学"
			}, {
				"n": "苏教版",
				"v": "苏教版高三数学"
			}]
		}, {
			"key": "duration",
			"name": "时长",
			"value": [{
				"n": "全部",
				"v": "0"
			}, {
				"n": "60分钟以上",
				"v": "4"
			}, {
				"n": "30~60分钟",
				"v": "3"
			}, {
				"n": "10~30分钟",
				"v": "2"
			}, {
				"n": "10分钟以下",
				"v": "1"
			}]
		}],
		"高三物理": [{
			"key": "tid",
			"name": "分类",
			"value": [{
				"n": "全部",
				"v": "0"
			}, {
				"n": "沪教版",
				"v": "沪教版高三物理"
			}, {
				"n": "人教版",
				"v": "人教版高三物理"
			}, {
				"n": "北师大版",
				"v": "北师大版高三物理"
			}, {
				"n": "苏教版",
				"v": "苏教版高三物理"
			}]
		}, {
			"key": "duration",
			"name": "时长",
			"value": [{
				"n": "全部",
				"v": "0"
			}, {
				"n": "60分钟以上",
				"v": "4"
			}, {
				"n": "30~60分钟",
				"v": "3"
			}, {
				"n": "10~30分钟",
				"v": "2"
			}, {
				"n": "10分钟以下",
				"v": "1"
			}]
		}],
		"高三化学": [{
			"key": "tid",
			"name": "分类",
			"value": [{
				"n": "全部",
				"v": "0"
			}, {
				"n": "沪教版",
				"v": "沪教版高三化学"
			}, {
				"n": "人教版",
				"v": "人教版高三化学"
			}, {
				"n": "北师大版",
				"v": "北师大版高三化学"
			}, {
				"n": "苏教版",
				"v": "苏教版高三化学"
			}]
		}, {
			"key": "duration",
			"name": "时长",
			"value": [{
				"n": "全部",
				"v": "0"
			}, {
				"n": "60分钟以上",
				"v": "4"
			}, {
				"n": "30~60分钟",
				"v": "3"
			}, {
				"n": "10~30分钟",
				"v": "2"
			}, {
				"n": "10分钟以下",
				"v": "1"
			}]
		}],
		"高三历史": [{
			"key": "tid",
			"name": "分类",
			"value": [{
				"n": "全部",
				"v": "0"
			}, {
				"n": "沪教版",
				"v": "沪教版高三历史"
			}, {
				"n": "人教版",
				"v": "人教版高三历史"
			}, {
				"n": "北师大版",
				"v": "北师大版高三历史"
			}, {
				"n": "苏教版",
				"v": "苏教版高三历史"
			}]
		}, {
			"key": "duration",
			"name": "时长",
			"value": [{
				"n": "全部",
				"v": "0"
			}, {
				"n": "60分钟以上",
				"v": "4"
			}, {
				"n": "30~60分钟",
				"v": "3"
			}, {
				"n": "10~30分钟",
				"v": "2"
			}, {
				"n": "10分钟以下",
				"v": "1"
			}]
		}],
		"高三生物": [{
			"key": "tid",
			"name": "分类",
			"value": [{
				"n": "全部",
				"v": "0"
			}, {
				"n": "沪教版",
				"v": "沪教版高三生物"
			}, {
				"n": "人教版",
				"v": "人教版高三生物"
			}, {
				"n": "北师大版",
				"v": "北师大版高三生物"
			}, {
				"n": "苏教版",
				"v": "苏教版高三生物"
			}]
		}, {
			"key": "duration",
			"name": "时长",
			"value": [{
				"n": "全部",
				"v": "0"
			}, {
				"n": "60分钟以上",
				"v": "4"
			}, {
				"n": "30~60分钟",
				"v": "3"
			}, {
				"n": "10~30分钟",
				"v": "2"
			}, {
				"n": "10分钟以下",
				"v": "1"
			}]
		}],
		"高三思想政治": [{
			"key": "tid",
			"name": "分类",
			"value": [{
				"n": "全部",
				"v": "0"
			}, {
				"n": "沪教版",
				"v": "沪教版高三思想政治"
			}, {
				"n": "人教版",
				"v": "人教版高三思想政治"
			}, {
				"n": "北师大版",
				"v": "北师大版高三思想政治"
			}, {
				"n": "苏教版",
				"v": "苏教版高三思想政治"
			}]
		}, {
			"key": "duration",
			"name": "时长",
			"value": [{
				"n": "全部",
				"v": "0"
			}, {
				"n": "60分钟以上",
				"v": "4"
			}, {
				"n": "30~60分钟",
				"v": "3"
			}, {
				"n": "10~30分钟",
				"v": "2"
			}, {
				"n": "10分钟以下",
				"v": "1"
			}]
		}],
		"高三地理": [{
			"key": "tid",
			"name": "分类",
			"value": [{
				"n": "全部",
				"v": "0"
			}, {
				"n": "沪教版",
				"v": "沪教版高三地理"
			}, {
				"n": "人教版",
				"v": "人教版高三地理"
			}, {
				"n": "北师大版",
				"v": "北师大版高三地理"
			}, {
				"n": "苏教版",
				"v": "苏教版高三地理"
			}]
		}, {
			"key": "duration",
			"name": "时长",
			"value": [{
				"n": "全部",
				"v": "0"
			}, {
				"n": "60分钟以上",
				"v": "4"
			}, {
				"n": "30~60分钟",
				"v": "3"
			}, {
				"n": "10~30分钟",
				"v": "2"
			}, {
				"n": "10分钟以下",
				"v": "1"
			}]


		}]
};
  return JSON.stringify({
      class: classes,
      filters: filterObj,
  });
}

async function homeVod() {
  let html = HOST + '/x/web-interface/search/type?search_type=video&keyword='+homeName;
  let data = JSON.parse(await request(html)).data.result;
  let videos = [];
  data.forEach(function(it) {
      if(it.bvid!==""){       videos.push({
          vod_id: it.aid,
          vod_name: stripHtmlTag(it.title),
          vod_pic: 'http:'+it.pic,
          vod_remarks: turnDHM(it.duration) || ''})};
  });
  return JSON.stringify({
      list: videos,
  });
}

async function category(tid, pg, filter, extend) {
  let html = HOST + '/x/web-interface/search/type?search_type=video&page=' + pg + '&keyword=' + (extend.tid || tid) + '&duration=' + (extend.duration || '') + '&order=' + (extend.order || '');
  let data = JSON.parse(await request(html)).data;
  let videos = [];
  data.result.forEach(function(it) {
      if(it.bvid!==""){       videos.push({
          vod_id: it.aid,
          vod_name: stripHtmlTag(it.title),
          vod_pic: 'https:' + it.pic,
          vod_remarks: turnDHM(it.duration) || ''})};
  });
  return JSON.stringify({
      page: parseInt(data.page),
      pagecount: data.numPages,
      limit: 20,
      total: data.numResults,
      list: videos,
  });
}

async function detail(id) {
  let data = JSON.parse(await request(HOST + '/x/web-interface/view?aid=' + id)).data;
  let vod = {
      vod_id: data.aid,
      vod_name: stripHtmlTag(data.title),
      vod_pic: data.pic,
      type_name: data.tname,
      vod_year: new Date(data.pubdate*1000).getFullYear(),
      vod_remarks: '',
      vod_director: data.owner.name,
      vod_content: stripHtmlTag(data.desc),
  };
  let episodes = data.pages;
  let playurls = [];
  episodes.forEach(function(it) {
    let cid = it.cid;
    let part = it.part.replace('#', '﹟').replace('$', '﹩');
    playurls.push(
        part + '$' + data.aid + '_' + cid
    )
  });
  let playUrl = playurls.join('#');
  vod.vod_play_from = 'B站';
  vod.vod_play_url = playUrl;
  return JSON.stringify({
    list: [vod],
  });
}

async function play(flag, id, flags) {
  let ids = id.split('_');
  let html = HOST + '/x/player/playurl?avid=' + ids[0] + '&cid=' + ids[1] + '&qn=116';
  let data = JSON.parse(await request(html)).data.durl;
  let maxSize = -1;
  let position = -1;  const dan = 'https://api.bilibili.com/x/v1/dm/list.so?oid=' + ids[1];
  data.forEach(function(it, i) {
      if (maxSize < Number(it.size)) {
          maxSize = Number(it.size);
          position = i
      }
  });
  let purl = '';
  if (data.length > 0) {
    if (position === -1) {
        position = 0
    }
    purl = data[position].url
  }
  // console.debug('我的哔哩 purl =====>' + purl); // js_debug.log
  return JSON.stringify({
    parse: 0,
    url: purl,    danmaku: dan,    
    header: getMb(),
  });
}

async function search(wd, quick, pg) {
  if(searchable==1){
  if (pg <= 0 || typeof(pg) == 'undefined') pg = 1;
  let html = HOST + '/x/web-interface/search/type?search_type=video&keyword=' + wd + '&page=' + pg;
  let data = JSON.parse(await request(html)).data;
  let videos = [];
  data.result.forEach(function(it) {
    if(it.bvid!==""){       videos.push({
        vod_id: it.aid,
        vod_name: stripHtmlTag(it.title),
        vod_pic: 'https:' + it.pic,
        vod_remarks: turnDHM(it.duration) || '',
    })};
  });
  return JSON.stringify({
      page: parseInt(data.page),
      pagecount: data.numPages,
      limit: 20,
      total: data.numResults,
      list: videos,
  });
  }else{
	  return null;
  }
}

function getHeader(cookie) {
  let header = {};
  header['cookie'] = cookie;
  header['User-Agent'] = PC_UA;
  header['Referer'] = 'https://www.bilibili.com';
  return header;
}

function getMb() {
  return getHeader(cookie);
}

function stripHtmlTag(src) {
  return src
      .replace(/<\/?[^>]+(>|$)/g, '')
      .replace(/&.{1,5};/g, '')
      .replace(/\s{2,}/g, ' ');
}

function turnDHM(duration) {
  let min = duration.split(':')[0];
  let sec = duration.split(':')[1];
  if (min == 0) {
      return sec + '秒';
  } else if (0 < min && min < 60) {
      return min + '分';
  } else if (60 <= min && min < 1440) {
      if (min % 60 == 0) {
          let h = min / 60;
          return h + '小时';
      } else {
          let h = min / 60;
          h = (h + '').split('.')[0];
          let m = min % 60;
          return h + '小时' + m + '分';
      }
  } else if (min >= 1440) {
      let d = min / 60 / 24;
      d = (d + '').split('.')[0];
      let h = min / 60 % 24;
      h = (h + '').split('.')[0];
      let m = min % 60;
      let dhm = '';
      if (d > 0) {
          dhm = d + '天'
      }
      if (h >= 1) {
          dhm = dhm + h + '小时'
      }
      if (m > 0) {
          dhm = dhm + m + '分'
      }
      return dhm;
  }
  return null;
}

export function __jsEvalReturn() {
  return {
      init: init,
      home: home,
      homeVod: homeVod,
      category: category,
      detail: detail,
      play: play,
      search: search,
  };
}
